#ifndef _PIT_H_
#define _PIT_H_
//==============================================================================
//文件名称：Pit.h
//功能概要：K60 pit底层驱动程序头文件
//版权所有：JYB
//版本更新：2013-12-16  V1.0  初始版本
//============================================================================== 
#include "common.h"
#include <stdio.h>

//2 宏定义
#define PIT0 0
#define PIT1 1
#define PIT2 2
#define PIT3 3

//2 函数定义
//==============================================================================
//函数名称: pit_init                                                         
//函数返回: 无                                          
//参数说明: pitno:表示pit通道号。  
//	        timeout:表示定时溢出开始递减的值,该PIT计数使用总线时钟          
//功能概要: 初始化PIT        
//==============================================================================
void pit_init(uint8 pitno,uint32 timeout);

//==============================================================================
//函数名称: enable_pit_interrupt                                                     
//函数返回: 无                                              
//参数说明: pitno: 表示pit通道号      
//功能概要: 开启PIT的IRQ中断                                                                                                     
//==============================================================================
void enable_pit_interrupt(uint8 pitno);

//==============================================================================
//函数名称: disable_pit_interrupt                                                     
//函数返回: 无                                              
//参数说明: pitno: 表示pit通道号      
//功能概要: 关闭PIT的IRQ中断                                                                                               
//==============================================================================
void disable_pit_interrupt(uint8 pitno);

#endif