#ifndef __BATTERYCHECK_H__
#define __BATTERYCHECK_H__
/******************************************************************************/
/*******************************************************************************
  文件名：电池检查BatteryCheck.h
  功  能：电池电压检测
  日  期：2015.07.14
  作  者：HJZ
  备  注：
*******************************************************************************/
/******************************************************************************/
//1. 头文件
//2. 宏定义
//3. 变量类型定义
//4. 变量声明
//5. 函数声明


//1. 头文件
#include "common.h"
#include "adc.h"



//4. 变量声明

extern uint16 BatteryCheckVal;   //电池电压AD采样值

//5. 函数声明
uint8 BatteryCheckInit(void);   //电池电压检测初始化
uint8 BatteryCheckUpdate(void);   //电池电压测量值更新



#endif //end of__BATTERYCHECK_H__